{
  "backend/main.mo": "Motoko backend actor that manages reviews and contact messages with Map storage, provides functions to submit/retrieve reviews (with 1-5 rating validation), submit contact messages, and return owner name 'Sumit Kapoor'.",
  "feature_evidence.json": "Feature evidence report documenting four completed features: updating About section statistics (500→100 projects, 1000→200 clients) and Contact section location/map updates with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing component structure, styling (navy/gold theme), backend integration via React Query, and SEO optimization for Delhi NCR construction services.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes, spacing (radius), and component styling tokens for the design system.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags targeting 'Construction Company in Delhi NCR', Open Graph/Twitter cards, favicon, and Google Fonts preconnect for Inter and Poppins.",
  "frontend/src/App.tsx": "Main React application component that renders the complete page layout with Header, all content sections (Hero, About, Services, WhyChooseUs, Projects, Reviews, Contact), and Footer.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying four statistics cards (24+ years, 100+ projects, 200+ clients, 100% satisfaction) and detailed company description highlighting Kapoor Builders' experience and services.",
  "frontend/src/components/ContactSection.tsx": "Contact section with Google Maps embed for D-37 Radheypuri location, contact info cards (phone, location, hours), owner name display (Sumit Kapoor), and form submission using useSubmitContactMessage hook.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company info, quick navigation links, services list, contact details, and social media icons. Includes smooth scrolling to page sections and dynamic app identifier based on hostname.",
  "frontend/src/components/Header.tsx": "Fixed header component with logo, desktop/mobile navigation, and scroll-based styling. Implements smooth scrolling to page sections and responsive mobile menu toggle.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with background image, company tagline, and call-to-action buttons for phone contact and consultation. Features gradient overlays and animated content.",
  "frontend/src/components/ProjectsGallery.tsx": "Projects gallery with category filtering (Residential, Commercial, Interior, etc.) displaying a grid of project images. Includes hover effects and responsive layout.",
  "frontend/src/components/ReviewsSection.tsx": "Reviews section with testimonial carousel and review submission form. Fetches reviews via custom hooks, displays star ratings, and handles new review submissions with validation.",
  "frontend/src/components/ServicesSection.tsx": "Services section displaying a grid of seven service cards (Residential, Commercial, Builder Floor, etc.) with icons, titles, and descriptions. Features hover animations and responsive layout.",
  "frontend/src/components/WhyChooseUsSection.tsx": "React component displaying a grid of 6 feature cards highlighting company differentiators (24+ years experience, on-time delivery, transparent pricing, skilled team, quality craftsmanship, trusted across Delhi NCR) with navy background, gold accents, and hover animations.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for backend data operations: fetching all reviews, submitting new reviews with name/rating/message, and submitting contact messages with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with navy blue and gold theme variables for light/dark modes, custom scrollbar styling, smooth scroll behavior, and fade-in animation utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with navy/gold colors, custom shadows (gold-glow, navy-glow), Poppins/Inter fonts, accordion and fade-in animations, and responsive container settings.",
  "project_state.json": "Project metadata documenting the Kapoor Builders website architecture with navy/gold theme, SEO optimization, responsive design, company stats (100+ projects, 200+ clients), office location, and implemented features including hero, about, services, why-choose-us, gallery, and reviews sections."
}